app/views/genre_display/new.html.erb

SELECT DISTINCT "genres"."id" FROM "genres"
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
SELECT "subgenres"."title" FROM "subgenres" WHERE "subgenres"."Genre_id" = ?  [["Genre_id", 1]]
---
<h1>Select a Genre and a Subgenre</h1><br>
<% Genre.distinct(:title).pluck(:id).each do |category| %>
	<% x=Genre.where(id: category) %>
	<h2> <u><%= x[0].title %></u> </h2>
	<% a= Subgenre.where(Genre_id: category).select(:title).map(&:title).uniq %>