app/controllers/genre_display_controller.rb

  def show
  	@test=Question.new()

  	a = Genre.where(title:params[:genre])
  	b = Subgenre.where(Genre_id:a[0].id)
  	$c = Question.where(Subgenre_id:b[0].id)
---
SELECT "genres".* FROM "genres" WHERE "genres"."title" = ?  [["title", "Entertainment"]]
SELECT "subgenres".* FROM "subgenres" WHERE "subgenres"."Genre_id" = ?  [["Genre_id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."Subgenre_id" = ?  [["Subgenre_id", 1]]

  def check
    a = Genre.where(title:params[:genre])
    b = Subgenre.where(Genre_id:a[0].id)
    $c = Question.where(Subgenre_id:b[0].id)
    $x = 1
  	@test=Question.new(question_params)
    string = ""
    if params[:question][:op1] == "1"
      string += "A"
    end
    if params[:question][:op2] == "1"
      string += "B"
    end
    if params[:question][:op3] == "1"
      string += "C"
    end
    if params[:question][:op4] == "1"
      string += "D"
    end
    restore = Restore.where(user_id: current_user.id)
    if(restore.empty? == true)
      restore = Restore.new()
      restore.user_id = current_user.id
      restore.last_ques = $x + 1
      restore.subgenre_id = 0
    if($c[$x].answer == string)
      restore.score = 1
    end
      restore.save()
---
SELECT "genres".* FROM "genres" WHERE "genres"."title" = ?  [["title", "Entertainment"]]
SELECT "subgenres".* FROM "subgenres" WHERE "subgenres"."Genre_id" = ?  [["Genre_id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."Subgenre_id" = ?  [["Subgenre_id", 1]]
SELECT "restores".* FROM "restores" WHERE "restores"."user_id" = ?  [["user_id", 2]]
SELECT  1 AS one FROM "restores" WHERE "restores"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "restores" ("user_id", "last_ques", "subgenre_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["last_ques", 7], ["subgenre_id", 0], ["score", 1], ["created_at", "2017-09-20 11:11:00.756523"], ["updated_at", "2017-09-20 11:11:00.756523"]]
UPDATE "restores" SET "last_ques" = ?, "updated_at" = ? WHERE "restores"."id" = ?  [["last_ques", 8], ["updated_at", "2017-09-20 11:18:50.962229"], ["id", 1]]