app/controllers/subgenres_controller.rb

SELECT "subgenres".* FROM "subgenres"
---
  def index
    @subgenres = Subgenre.all

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_subgenre
      @subgenre = Subgenre.find(params[:id])